{
# 【1. 公众号配置：所有信息都在刚注册的公众号中找到】
# 公众号appId，替换掉下方文字内容，不要删除双引号
"app_id": "wxa3f3f712ac8e315a",

# 公众号appSecret，替换掉下方文字内容，不要删除双引号
"app_secret": "e1a46122d7e502c986915c4bb1a363a0",

# 模板消息接口里的模板ID，替换掉下方文字内容，不要删除双引号
"template_id": "d_96DgLrnOp6djq4PCK-_07782mL1_P3Kyp-UT7IRAc",

# 接收公众号消息的微信号（user-id），如果有多个，需要在[]里用英文逗号间隔，例如["wx1", "wx2"]
"user": ["oGY7i6iQ2e4yQSycoJz6axsWdE9o","oGY7i6qNe2wOR8LKuiYKkUNq08_A"],

# 【2. 信息配置】
# 所在省份
"province": "广东",

# 所在城市
"city": "深圳",

# 生日1，如果生日为农历，在最前面加上r即可，如r1999-01-01
"birthday1": "r1989-03-23",
# 生日2
"birthday2": "r1989-10-28",

# 在一起的日子，格式同上
"love_date": "2024-04-30",


#######################################
#########【3.是否启用每日一句英语】##########
#######################################
#如果要启用，请把下面的 否 改为 是 ，注意要保留双引号
#如果不用这个接口，请不要改动里面的内容
"Whether_Eng":"否",
###注意要在消息模板中加入{{note_ch.DATA}}和{{note_en.DATA}}，才能够正常显示


#######################################
#############【4.彩虹屁API设置】#############
#######################################
#请把你申请的彩虹屁API接口替换掉下方的文字"替换掉我"，注意要保留双引号
#如果不用这个接口，请不要改动里面的内容

"caihongpi_API":"ad6178ca718e34a1d827eca5511c8546",

###注意要在消息模板中加入{{pipi.DATA}}，才能够正常显示

#######################################
#############【5.励志古言API设置】###########
#######################################
#请把你申请的励志古言API接口替换掉下方的文字"替换掉我"，注意要保留双引号
#如果不用这个接口，请不要改动里面的内容

#替换成key 
"lizhi_API":"ad6178ca718e34a1d827eca5511c8546",

###注意要在消息模板中加入{{lizhi.DATA}}，才能够正常显示

#######################################
#############【6.天气预报API设置】###########
#######################################
#请把你申请的天气预报API接口替换掉下方的文字"替换掉我"，注意要保留双引号
#如果不用这个接口，请不要改动里面的内容
#这个API本程序目前只提取了当天的天气情况，只会给出当天降雨量以及出行建议。
#如果需要提取未来日期需要等待开发，或者自行更改源码。

"tianqi_API":"ad6178ca718e34a1d827eca5511c8546",

###注意要在消息模板中加入{{tianqi.DATA}}，才能够正常显示


#######################################
###########【7.健康小提示API设置】###########
#######################################
#请把你申请的健康小提示API接口替换掉下方的文字"替换掉我"，注意要保留双引号
#如果不用这个接口，请不要改动里面的内容

"health_API":"ad6178ca718e34a1d827eca5511c8546",

###注意要在消息模板中加入{{health.DATA}}，才能够正常显示

#######################################
#############【8.星座运势API设置】###########
#######################################
#请把你申请的星座运势API接口替换掉下方的文字"替换掉我"，注意要保留双引号
#如果不用这个接口，请不要改动里面的内容

"lucky_API":"ad6178ca718e34a1d827eca5511c8546",
#请在下方填入你的星座，中文即可，如"天蝎座"
"astro":"白羊座"
###注意要在消息模板中加入{{lucky.DATA}}，才能够正常显示
}

